
## Plan Result

[CI link](https://github.com/shion1305/lumos-profile-management/actions/runs/8680597843)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_artifact_registry_repository.main-repo


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.main-repo will be created
  + resource "google_artifact_registry_repository" "main-repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = (known after apply)
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "asia-northeast1"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "lumos-profile-management"
      + repository_id          = "main"
      + terraform_labels       = (known after apply)
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete"

          + condition {
              + older_than            = "14d"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }
      + cleanup_policies {
          + action = "KEEP"
          + id     = "keep-minimum-versions"

          + most_recent_versions {
              + keep_count            = 5
              + package_name_prefixes = []
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"build-and-deploy","PRNumber":27,"Program":"tfcmt","SHA1":"9a1b6c8eaefef07fc1a6d06692bcc226057f0e25","Vars":{},"WorkflowName":"Terraform Plan for Artifact Registry"} -->